lib/tasks/index_data.rake

task index_data: :environment do
  openai_client = OpenAI::Client.new

  DATA.each do |item|
    page_name, text = item

    response = openai_client.embeddings(
      parameters: {
        model: 'text-embedding-ada-002',
        input: text
      }
    )

    embedding = response.dig('data', 0, 'embedding')

    Item.create!(page_name:, text:, embedding:)
---
INSERT INTO "items" ("page_name", "text", "embedding", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"