app/controllers/application_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
	def index
		User.first.update(question_offset: 0)