app/controllers/chatbot_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def set_user_data
    #@user = User.find(params[:id])
    @user = User.first