app/controllers/users_controller.rb

	def index
		@users = User.all
		puts "!!!Clearing offset!!!"
		User.first.update(question_offset: 0)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]